project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/Common/WPAN/stm32_lpm_if.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    stm32_lpm_if.c
 * @author  MCD Application Team
 * @brief   Low layer function to enter/exit low power modes (stop, sleep)
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#include "arm_compat.h"
#endif /*(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050) */
#include "RTDebug.h"
#include "app_sys.h"
#include "cmsis_compiler.h"
#include "main.h"
#include "peripheral_init.h"
#include "scm.h"
#include "stm32_lpm.h"
#include "stm32_lpm_if.h"
#include "stm32wbaxx.h"
#include "stm32wbaxx_hal_pwr.h"
#include "stm32wbaxx_ll_icache.h"
#include "utilities_common.h"
#if (CFG_RT_DEBUG_DTB == 1)
#include "RTDebug_dtb.h"
#endif /* CFG_RT_DEBUG_DTB */
#include "assert.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
#if (CFG_LPM_WAKEUP_TIME_PROFILING == 1)
#define LL_DEEPSLEEP_EXIT_TIME_US 230    /* Time in us needed for Link Layer deepsleep exit */
#define DEVICE_WAKEUP_STANDBY_TIME_US 60 /* Time in us needed by the device to exit from standby */
#if defined(RCC_LSI2_SUPPORT)
#define LSI2_FREQ_WORST_VALUE 24000   /* Worst value of LSI2 frequency */
#endif                                /* RCC_LSI2_SUPPORT */
#define RTOS_EXTRA_WAKEUP_TIME_US 100 /* Additional time in us to wakeup in context of an RTOS */

#endif /* CFG_LPM_WAKEUP_TIME_PROFILING */
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/**
 * @brief Array of LPM driver configurations.
 *
 * This array contains the configurations for different low power modes
 * and the corresponding functions to handle those modes.
 *
 *@note It must be ordered from the less efficient (index 0)
 *      to the most efficient low power mode
 */
const UTIL_LPM_Driver_fp UTIL_LPM_Driver[] = { LPM_IdleMode, LPM_SleepMode,
#if (CFG_LPM_STOP1_SUPPORTED == 1)
                                               LPM_Stop1Mode,
#endif /* (CFG_LPM_STOP1_SUPPORTED == 1) */
#if (CFG_LPM_STOP2_SUPPORTED == 1)
                                               LPM_Stop2Mode,
#endif /* (CFG_LPM_STOP2_SUPPORTED == 1) */
#if (CFG_LPM_STANDBY_SUPPORTED == 1)
                                               LPM_StandbyMode
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1)  */
};

/**
 * @brief Number of LPM drivers.
 *
 * This constant holds the number of entries in the UTIL_LPM_Driver array.
 */
const uint32_t UTIL_LPM_Driver_num = sizeof(UTIL_LPM_Driver) / sizeof(UTIL_LPM_Driver_fp);

/**
 * @brief Assertion to ensure at least one driver is registered in interface file.
 */
static_assert(sizeof(UTIL_LPM_Driver) != 0, "at least one LPM driver is required");
/* Check not too many drivers are registered in interface file */

/**
 * @brief Assertion to ensure registered drivers are within boundaries.
 */
static_assert((sizeof(UTIL_LPM_Driver) / sizeof(UTIL_LPM_Driver_fp)) <= UTIL_LPM_DRIVER_MAX_NUM, "too many LPM drivers registered");

/**
 * @brief Assertion to ensure drivers and associated enum type are aligned
 */
static_assert((sizeof(UTIL_LPM_Driver) / sizeof(UTIL_LPM_Driver_fp)) == UTIL_LPM_NUM_MODES,
              "UTIL_LPM_Mode_t enum not aligned with UTIL_LPM_Driver size");

/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* External variables --------------------------------------------------------*/
/* Variable to store the MainStackPointer before entering standby wfi */
uint32_t backup_MSP;
uint32_t backup_MSPLIM;
uint32_t backup_PSP;
uint32_t backup_PSPLIM;
uint32_t backup_CONTROL;
uint32_t backup_prio_SysTick_IRQn;
uint32_t backup_prio_SVCall_IRQn;
uint32_t backup_prio_PendSV_IRQn;
static uint32_t boot_after_standby;

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private variables ---------------------------------------------------------*/
#if (CFG_SCM_SUPPORTED == 0)
/* If SCM is not supported, SRAM handles for waitsate configurations are defined here */
static RAMCFG_HandleTypeDef sram1_ns = {
    RAMCFG_SRAM1,           /* Instance */
    HAL_RAMCFG_STATE_READY, /* RAMCFG State */
    0U,                     /* RAMCFG Error Code */
};

static RAMCFG_HandleTypeDef sram2_ns = {
    RAMCFG_SRAM2,           /* Instance */
    HAL_RAMCFG_STATE_READY, /* RAMCFG State */
    0U,                     /* RAMCFG Error Code */
};
#endif /* CFG_SCM_SUPPORTED */

#if (CFG_LPM_WAKEUP_TIME_PROFILING == 1)
#if (CFG_LPM_STANDBY_SUPPORTED == 1)
static uint32_t lpm_wakeup_time_standby = 0;
#if defined(RCC_LSI2_SUPPORT)
static uint8_t lpm_profiling_started_lsi2 = 0;
#endif /* RCC_LSI2_SUPPORT */
#endif /* CFG_LPM_STANDBY_SUPPORTED */
#endif /* CFG_LPM_WAKEUP_TIME_PROFILING */
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

