project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/Common/WPAN/stm32_lpm_if.c
/* Private function prototypes -----------------------------------------------*/
#if (CFG_LPM_STANDBY_SUPPORTED == 1)
void Standby_Restore_GPIO(void);
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) */
#if (CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP1_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1)
static void Enter_Stop_Standby_Mode(void);
static void Exit_Stop_Standby_Mode(void);
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP1_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1) */
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
extern void LINKLAYER_PLAT_NotifyWFIExit(void);
extern void LINKLAYER_PLAT_NotifyWFIEnter(void);
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

#if (CFG_LPM_STANDBY_SUPPORTED == 1)
__WEAK OPTIMIZED void Standby_Restore_GPIO(void)
{
    uint32_t temp;

    /*##-1- Enable peripherals and GPIO Clocks #################################*/
    /* Enable GPIO TX/RX clock */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();

    // ---------------------------------------------------------------------------

    /* Configure GPIOA_MODER 15:13 AF (JTAG), 12:0 Input */
    LL_GPIO_WriteReg(GPIOA, MODER,
                     ((LL_GPIO_MODE_ALTERNATE << (POSITION_VAL(LL_GPIO_PIN_15) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_ALTERNATE << (POSITION_VAL(LL_GPIO_PIN_14) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_ALTERNATE << (POSITION_VAL(LL_GPIO_PIN_13) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_12) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_11) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_10) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_9) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_8) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_7) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_6) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_5) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_4) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_3) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_2) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_1) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_0) * GPIO_MODER_MODE1_Pos))));

    __ASM("mov r0, r0"); /* Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input */
    __ASM("mov r0, r0"); /* Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input */

    temp = LL_GPIO_ReadInputPort(GPIOA);
    LL_GPIO_WriteOutputPort(GPIOA, temp); /* Restore Port A output drive levels */

    /* GPIOA_MODER set to reset value */
    LL_GPIO_WriteReg(GPIOA, MODER, 0xABFFFFFF);

    // ---------------------------------------------------------------------------

    /* Configure GPIOB_MODER 4:3 AF (JTAG), 15:5, 2:0 In */
    LL_GPIO_WriteReg(GPIOB, MODER,
                     ((LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_15) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_14) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_13) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_12) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_11) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_10) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_9) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_8) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_7) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_6) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_5) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_ALTERNATE << (POSITION_VAL(LL_GPIO_PIN_4) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_ALTERNATE << (POSITION_VAL(LL_GPIO_PIN_3) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_2) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_1) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_0) * GPIO_MODER_MODE1_Pos))));

    __ASM("mov r0, r0"); // Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input
    __ASM("mov r0, r0"); // Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input

    temp = LL_GPIO_ReadInputPort(GPIOB);
    LL_GPIO_WriteOutputPort(GPIOB, temp); // Restore Port B output drive levels

    /* GPIOB_MODER set to reset value */
    LL_GPIO_WriteReg(GPIOB, MODER, 0xFFFFFEBF);

    // ---------------------------------------------------------------------------

    /* Configure GPIOC_MODER 15:13 In */
    LL_GPIO_WriteReg(GPIOC, MODER,
                     ((LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_15) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_14) * GPIO_MODER_MODE1_Pos)) |
                      (LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_13) * GPIO_MODER_MODE1_Pos))));

    __ASM("mov r0, r0"); // Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input
    __ASM("mov r0, r0"); // Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input

    temp = LL_GPIO_ReadInputPort(GPIOC);
    LL_GPIO_WriteOutputPort(GPIOC, temp); // Restore Port C output drive levels

