project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/Common/WPAN/stm32_lpm_if.c
    /* GPIOC_MODER set to reset value */
    LL_GPIO_WriteReg(GPIOC, MODER, 0xFC000000);

    // ---------------------------------------------------------------------------

    /* Configure GPIOH_MODER 3 In */
    LL_GPIO_WriteReg(GPIOH, MODER, ((LL_GPIO_MODE_INPUT << (POSITION_VAL(LL_GPIO_PIN_3) * GPIO_MODER_MODE1_Pos))));

    __ASM("mov r0, r0"); // Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input
    __ASM("mov r0, r0"); // Delay to allow GPIOx_IDR.IDy to be updated after GPIOx_MODER is set to Input

    temp = LL_GPIO_ReadInputPort(GPIOH);
    LL_GPIO_WriteOutputPort(GPIOH, temp); // Restore Port H output drive levels

    /* GPIOH_MODER set to reset value */
    LL_GPIO_WriteReg(GPIOH, MODER, 0x0000C000);

    // ---------------------------------------------------------------------------
}
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) */

#if (CFG_SCM_SUPPORTED != 1) &&                                                                                                    \
    ((CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP1_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1))
OPTIMIZED static void Clock_Switching(void)
{
    /* Activate HSE clock */
    LL_RCC_HSE_Enable();
    while (LL_RCC_HSE_IsReady() == 0)
        ;
    /* Apply PWR VOS1 power level */
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1); /* Double write for flag readiness to cope with hw latency */
    while (LL_PWR_IsActiveFlag_VOS() == 0)
        ;

    /* Switch HSE frequency from HSE16 to HSE32 */
    LL_RCC_HSE_DisablePrescaler();

    /* Switch CPU system clock to HSE */
    LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSE);
    while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSE)
        ;

    /* Apply HSE32 compatible waitstates */
    __HAL_FLASH_SET_LATENCY(FLASH_LATENCY_0);
    while (__HAL_FLASH_GET_LATENCY() != FLASH_LATENCY_0)
        ;
    HAL_RAMCFG_ConfigWaitState(&sram1_ns, RAMCFG_WAITSTATE_0);
    HAL_RAMCFG_ConfigWaitState(&sram2_ns, RAMCFG_WAITSTATE_0);

    /* Set HDIV 5 */
    LL_RCC_SetAHB5Divider(LL_RCC_AHB5_DIVIDER_1); /* divided by 1 */

    /* Switched to HSE, so disable HSI */
    LL_RCC_HSI_Disable();

    /* Ensure time base clock coherency */
    SystemCoreClockUpdate();
}
#endif /* (CFG_SCM_SUPPORTED != 1) && ((CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP1_SUPPORTED == 1) ||                       \
          (CFG_LPM_STOP2_SUPPORTED == 1)) */

#if (CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP1_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1)
OPTIMIZED static void Enter_Stop_Standby_Mode(void)
{
    /* Disabling ICACHE */
    LL_ICACHE_Disable();
#if defined(STM32WBAXX_SI_CUT1_0)
    /* Wait until ICACHE_SR.BUSYF is cleared */
    while (LL_ICACHE_IsActiveFlag_BUSY() == 1U)
        ;

    /* Wait until ICACHE_SR.BSYENDF is set */
    while (LL_ICACHE_IsActiveFlag_BSYEND() == 0U)
        ;
#endif /* STM32WBAXX_SI_CUT1_0 */

#if (CFG_SCM_SUPPORTED == 1)
    scm_setwaitstates(LP);
#else
    /* SCM module is not supported, apply low power compatible waitstates */
    __HAL_FLASH_SET_LATENCY(FLASH_LATENCY_3);
    while (__HAL_FLASH_GET_LATENCY() != FLASH_LATENCY_3)
        ;
    HAL_RAMCFG_ConfigWaitState(&sram1_ns, RAMCFG_WAITSTATE_1);
    HAL_RAMCFG_ConfigWaitState(&sram2_ns, RAMCFG_WAITSTATE_1);
#endif /* CFG_SCM_SUPPORTED */

    LL_LPM_EnableDeepSleep();

    while (LL_PWR_IsActiveFlag_ACTVOS() == 0)
        ;
}

OPTIMIZED static void Exit_Stop_Standby_Mode(void)
{
    LL_ICACHE_Enable();
    while (LL_ICACHE_IsEnabled() == 0U)
        ;
#if (CFG_SCM_SUPPORTED == 1)
    if (LL_PWR_IsActiveFlag_STOP() == 1U)
    {
        /* SCM HSE BEGIN */
        /* Clear SW_HSERDY, if needed */
        if (isRadioActive() == SCM_RADIO_NOT_ACTIVE)
        {
            SCM_HSE_Clear_SW_HSERDY();
        }
        /* SCM HSE END */
        scm_setup();
    }
    else
    {
        scm_setwaitstates(RUN);
    }
#else
    if (LL_PWR_IsActiveFlag_STOP() == 1U)
    {
        Clock_Switching();
    }
    else
    {
        /* Apply waitsates for HSE32 configuration */
        __HAL_FLASH_SET_LATENCY(FLASH_LATENCY_0);
        while (__HAL_FLASH_GET_LATENCY() != FLASH_LATENCY_0)
            ;
        HAL_RAMCFG_ConfigWaitState(&sram1_ns, RAMCFG_WAITSTATE_0);
        HAL_RAMCFG_ConfigWaitState(&sram2_ns, RAMCFG_WAITSTATE_0);
    }
#endif /* CFG_SCM_SUPPORTED */
}
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP1_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1) */

#if (CFG_LPM_STANDBY_SUPPORTED == 1)
OPTIMIZED static void PWR_EnterOffMode(void)
{
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STANDBY_MODE_ENTER);

    /* USER CODE BEGIN PWR_EnterOffMode_1 */

    /* USER CODE END PWR_EnterOffMode_1 */

    /* Notify the Link Layer platform layer the system will enter in WFI
     * and AHB5 clock may be turned of regarding the 2.4Ghz radio state
     */
    LINKLAYER_PLAT_NotifyWFIEnter();

    /*
     * There is no risk to clear all the WUF here because in the current implementation, this API is called
     * in critical section. If an interrupt occurs while in that critical section before that point,
     * the flag is set and will be cleared here but the system will not enter Off Mode
     * because an interrupt is pending in the NVIC. The ISR will be executed when moving out
     * of this critical section
     */

    Enter_Stop_Standby_Mode();

    /* Set low power mode to standby */
    LL_PWR_SetPowerMode(LL_PWR_MODE_STANDBY);

    /* This option is used to ensure that store operations are completed */
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    __force_stores();
#endif /*(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050) */

    backup_CONTROL = __get_CONTROL();

    /* Check if Stack Pointer if pointing to PSP */
    if ((backup_CONTROL & CONTROL_SPSEL_Msk) == CONTROL_SPSEL_Msk)
    {
        __set_CONTROL(__get_CONTROL() & ~CONTROL_SPSEL_Msk); /* switch SP to MSP */
    }

    /* Save selected CPU peripheral regisers */
    backup_PSP               = __get_PSP();
    backup_PSPLIM            = __get_PSPLIM();
    backup_MSPLIM            = __get_MSPLIM();
    backup_prio_SysTick_IRQn = NVIC_GetPriority(SysTick_IRQn);
    backup_prio_SVCall_IRQn  = NVIC_GetPriority(SVCall_IRQn);
    backup_prio_PendSV_IRQn  = NVIC_GetPriority(PendSV_IRQn);
    backup_system_register();

