project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/Common/WPAN/stm32_lpm_if.c
    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STANDBY_MODE_ENTER);
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STANDBY_MODE_ACTIVE);

    /* Save Cortex general purpose registers on stack and call WFI instruction */
    CPUcontextSave();

    /* At this point, system comes out of standby. Restore selected CPU peripheral registers */
    restore_system_register();
#if defined(STM32WBAXX_SI_CUT1_0)
    SYS_WAITING_CYCLES_25();
#endif /* STM32WBAXX_SI_CUT1_0 */

    __set_MSPLIM(backup_MSPLIM);
    __set_PSPLIM(backup_PSPLIM);
    __set_PSP(backup_PSP);
    __set_CONTROL(backup_CONTROL); /* SP may switch back to PSP */

    if (1UL == boot_after_standby)
    {
#if (CFG_RT_DEBUG_DTB == 1) || (CFG_RT_DEBUG_GPIO_MODULE == 1)
        Standby_Restore_GPIO();
#endif /* ((CFG_RT_DEBUG_DTB == 1) || (CFG_RT_DEBUG_GPIO_MODULE == 1) */
#if (CFG_RT_DEBUG_DTB == 1)
        RT_DEBUG_DTBInit();
        RT_DEBUG_DTBConfig();
#endif /* CFG_RT_DEBUG_DTB */
#if (CFG_RT_DEBUG_GPIO_MODULE == 1)
        RT_DEBUG_GPIO_Init();
#endif /* (CFG_RT_DEBUG_GPIO_MODULE == 1) */
    }

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STANDBY_MODE_ACTIVE);

    /* USER CODE BEGIN PWR_EnterOffMode_2 */

    /* USER CODE END PWR_EnterOffMode_2 */
}
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) */

#if (CFG_LPM_STANDBY_SUPPORTED == 1)
OPTIMIZED static void PWR_ExitOffMode(void)
{
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STANDBY_MODE_EXIT);

    /* USER CODE BEGIN PWR_ExitOffMode_1 */

    /* USER CODE END PWR_ExitOffMode_1 */

    if (1UL == boot_after_standby)
    {
        boot_after_standby = 0;
#if (CFG_SCM_SUPPORTED == 1)
        /* SCM HSE BEGIN */
        SCM_HSE_Clear_SW_HSERDY();
        /* SCM HSE END */
#endif /* CFG_SCM_SUPPORTED */
        HAL_NVIC_SetPriority(RADIO_INTR_NUM, RADIO_INTR_PRIO_LOW, 0);
        HAL_NVIC_EnableIRQ(RADIO_INTR_NUM);
        HAL_NVIC_SetPriority(RADIO_SW_LOW_INTR_NUM, RADIO_SW_LOW_INTR_PRIO, 0);
        HAL_NVIC_EnableIRQ(RADIO_SW_LOW_INTR_NUM);
        HAL_NVIC_SetPriority(RCC_IRQn, RCC_INTR_PRIO, 0);
        HAL_NVIC_EnableIRQ(RCC_IRQn);
        HAL_NVIC_SetPriority(RTC_IRQn, 0x07, 0);
        HAL_NVIC_EnableIRQ(RTC_IRQn);
        NVIC_SetPriority(SysTick_IRQn, backup_prio_SysTick_IRQn);
        NVIC_EnableIRQ(SysTick_IRQn);
        NVIC_SetPriority(SVCall_IRQn, backup_prio_SVCall_IRQn);
        NVIC_EnableIRQ(SVCall_IRQn);
        NVIC_SetPriority(PendSV_IRQn, backup_prio_PendSV_IRQn);
        NVIC_EnableIRQ(PendSV_IRQn);

        /*
         ***********************************
         * Restore SoC HW configuration
         ***********************************
         */

        /* Enable AHB5ENR peripheral clock (bus CLK) */
        __HAL_RCC_RADIO_CLK_ENABLE();

        /* Notify the Link Layer platform layer the system exited WFI
         * and AHB5 clock may be resynchronized as is may have been
         * turned of during low power mode entry.
         */
        LINKLAYER_PLAT_NotifyWFIExit();

        /* USER CODE BEGIN PWR_ExitOffMode_2 */

        /* USER CODE END PWR_ExitOffMode_2 */

        /* Apply Prefetch configuration is enabled */
#if (PREFETCH_ENABLE != 0U)
        __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
#endif /* PREFETCH_ENABLE */

        MX_StandbyExit_PeripheralInit();

        /* Restore system clock configuration */
#if (CFG_SCM_SUPPORTED == 1)
        scm_standbyexit();
#else
        Clock_Switching();
#endif /* CFG_SCM_SUPPORTED */

        /* Enable RTC peripheral clock */
        LL_PWR_EnableBkUpAccess();
        __HAL_RCC_RTCAPB_CLK_ENABLE();

        /* Important note: at this point, all the IOs configuration is done */

        /* Clear all IOs retention status  */
        HAL_PWREx_DisableStandbyRetainedIOState(PWR_GPIO_A, PWR_GPIO_PIN_MASK);
        HAL_PWREx_DisableStandbyRetainedIOState(PWR_GPIO_B, PWR_GPIO_PIN_MASK);
        HAL_PWREx_DisableStandbyRetainedIOState(PWR_GPIO_C, PWR_GPIO_PIN_MASK);
        HAL_PWREx_DisableStandbyRetainedIOState(PWR_GPIO_H, PWR_GPIO_PIN_MASK);

#if (CFG_LPM_WAKEUP_TIME_PROFILING == 1)
        if (LPM_is_wakeup_time_profiling_done() == 0)
        {
            /* Compute amount of time spent to start from standby wakeup */
            lpm_wakeup_time_standby = SysTick->LOAD;
            lpm_wakeup_time_standby -= SysTick->VAL; /* Compute time the sysTick has counted */
            lpm_wakeup_time_standby *= 1000000U;
            if (LL_RCC_GetSystickClockSource() == LL_RCC_SYSTICK_CLKSOURCE_LSE)
            {
                lpm_wakeup_time_standby /= LSE_VALUE;
            }
#if defined(RCC_LSI2_SUPPORT)
            else if (LL_RCC_GetSystickClockSource() == LL_RCC_SYSTICK_CLKSOURCE_LSI)
            {
                lpm_wakeup_time_standby /= LSI2_FREQ_WORST_VALUE;
            }
#endif /* RCC_LSI2_SUPPORT */
            else
            {
                /* Such situation shall not happen, Systick clock source has changed during wakeup time profiling */
                Error_Handler();
            }
            lpm_wakeup_time_standby += LL_DEEPSLEEP_EXIT_TIME_US + DEVICE_WAKEUP_STANDBY_TIME_US;
            lpm_wakeup_time_standby += RTOS_EXTRA_WAKEUP_TIME_US; /* Additional time to wakeup in context of an RTOS */

#if defined(RCC_LSI2_SUPPORT)
            /** If LSI2 is used for profiling, since the profile value is based on the worst
             * case for LSI2 frequency, the minimum value between the value profiled
             * and the default value is considered for lpm_wakeup_time_standby
             */
            if (LL_RCC_GetSystickClockSource() == LL_RCC_SYSTICK_CLKSOURCE_LSI)
            {
                lpm_wakeup_time_standby = MIN(lpm_wakeup_time_standby, CFG_LPM_STDBY_WAKEUP_TIME);
            }
#endif /* RCC_LSI2_SUPPORT */
            /* USER CODE BEGIN CFG_LPM_WAKEUP_TIME_PROFILING_1 */

            /* USER CODE END CFG_LPM_WAKEUP_TIME_PROFILING_1 */

            APP_SYS_SetWakeupOffset(lpm_wakeup_time_standby);
#if defined(RCC_LSI2_SUPPORT)
            /* Disable LSI2 if used for wakeup time profiling */
            if (lpm_profiling_started_lsi2 != 0)
            {
                uint8_t pwrclkchanged = 0;
                if (__HAL_RCC_PWR_IS_CLK_ENABLED() != 1U)
                {
                    __HAL_RCC_PWR_CLK_ENABLE();
                    pwrclkchanged = 1;
                }

