project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/Common/WPAN/stm32_lpm_if.c
                /* Enable write access to Backup domain */
                LL_PWR_EnableBkUpAccess();
                while (LL_PWR_IsEnabledBkUpAccess() == 0UL)
                    ;

                LL_RCC_LSI2_Disable();

                if (pwrclkchanged == 1)
                {
                    __HAL_RCC_PWR_CLK_DISABLE();
                }
            }
#endif /* RCC_LSI2_SUPPORT */
            /* Disable SysTick Timer */
            CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk);

            /* Put back user sysTick clock source settings */
            /* Select SysTick source clock */
            HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_LSE);

            /* Initialize SysTick */
            HAL_StatusTypeDef hal_status;
            hal_status = HAL_InitTick(TICK_INT_PRIORITY);
            if (hal_status != HAL_OK)
            {
                assert_param(0);
            }
        }
#endif /* CFG_LPM_WAKEUP_TIME_PROFILING */
    }
    else
    {
        Exit_Stop_Standby_Mode();
    }

    /* USER CODE BEGIN PWR_ExitOffMode_3 */

    /* USER CODE END PWR_ExitOffMode_3 */

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STANDBY_MODE_EXIT);
}
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) */

#if (CFG_LPM_STOP2_SUPPORTED == 1)
OPTIMIZED static void PWR_EnterStop2Mode(void)
{
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STOP2_MODE_ENTER);

    /* USER CODE BEGIN PWR_EnterStop2Mode_1 */

    /* USER CODE END PWR_EnterStop2Mode_1 */

    /* Notify the Link Layer platform layer the system will enter in WFI
     * and AHB5 clock may be turned of regarding the 2.4Ghz radio state
     */
    LINKLAYER_PLAT_NotifyWFIEnter();

    /*
     * There is no risk to clear all the WUF here because in the current implementation, this API is called
     * in critical section. If an interrupt occurs while in that critical section before that point,
     * the flag is set and will be cleared here but the system will not enter Off Mode
     * because an interrupt is pending in the NVIC. The ISR will be executed when moving out
     * of this critical section
     */

    Enter_Stop_Standby_Mode();

    /* Set low power mode to stop2 */
    LL_PWR_SetPowerMode(LL_PWR_MODE_STOP2);

    /* Set unretained peripherals GPIOs to output mode */
    if (READ_BIT(SPI3->CFG2, SPI_CFG2_MASTER) != 0UL)
    {
        /* SPI3 SCK */
        if (LL_GPIO_IsInputPinSet(GPIOA, LL_GPIO_PIN_0) == 1UL)
        {
            LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0);
        }
        else
        {
            LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_0);
        }
        LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_0, LL_GPIO_MODE_OUTPUT);
        /* SPI3 MOSI */
        LL_GPIO_SetPinMode(GPIOB, LL_GPIO_PIN_8, LL_GPIO_MODE_OUTPUT);
    }
    else
    {
        /* SPI3 MISO */
        LL_GPIO_SetPinMode(GPIO, LL_GPIO_PIN_, LL_GPIO_MODE_OUTPUT);
    }
    /* USART1 TX */
    LL_GPIO_SetOutputPin(GPIOB, LL_GPIO_PIN_12);
    LL_GPIO_SetPinMode(GPIOB, LL_GPIO_PIN_12, LL_GPIO_MODE_OUTPUT);
    /* USART2 TX */
    LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_12);
    LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_12, LL_GPIO_MODE_OUTPUT);

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STOP2_MODE_ENTER);
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STOP2_MODE_ACTIVE);

    /* Wait for interrupt */
    __WFI();

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STOP2_MODE_ACTIVE);

    /* USER CODE BEGIN PWR_EnterStop2Mode_2 */

    /* USER CODE END PWR_EnterStop2Mode_2 */
}
#endif /* (CFG_LPM_STOP2_SUPPORTED == 1) */

#if (CFG_LPM_STOP2_SUPPORTED == 1)
OPTIMIZED static void PWR_ExitStop2Mode(void)
{
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STOP2_MODE_EXIT);

    /* USER CODE BEGIN PWR_ExitStop2Mode_1 */

    /* USER CODE END PWR_ExitStop2Mode_1 */

    /* Notify the Link Layer platform layer the system exited WFI
     * and AHB5 clock may be resynchronized as is may have been
     * turned of during low power mode entry.
     */
    LINKLAYER_PLAT_NotifyWFIExit();

    /* effectively gone in stop2 */
    if (LL_PWR_IsActiveFlag_STOP2() == 1U)
    {

        LL_ICACHE_Enable();
        while (LL_ICACHE_IsEnabled() == 0U)
            ;

#if (CFG_SCM_SUPPORTED == 1)
        /* SCM HSE BEGIN */
        SCM_HSE_Clear_SW_HSERDY();
        /* SCM HSE END */
#endif /* (CFG_SCM_SUPPORTED == 1) */

        /* Restore unretained peripherals */
        MX_Stop2Exit_PeripheralInit();

#if (CFG_SCM_SUPPORTED == 1)
        scm_standbyexit();
#else
        Clock_Switching();
#endif /* (CFG_SCM_SUPPORTED == 1) */
    }
    else
    {
        /* Restore unretained peripherals GPIOs to alternate mode */
        if (READ_BIT(SPI3->CFG2, SPI_CFG2_MASTER) != 0UL)
        {
            /* SPI3 SCK */
            LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_0, LL_GPIO_MODE_ALTERNATE);
            /* SPI3 MOSI */
            LL_GPIO_SetPinMode(GPIOB, LL_GPIO_PIN_8, LL_GPIO_MODE_ALTERNATE);
        }
        else
        {
            /* SPI3 MISO */
            LL_GPIO_SetPinMode(GPIO, LL_GPIO_PIN_, LL_GPIO_MODE_ALTERNATE);
        }
        /* USART1 TX */
        LL_GPIO_SetPinMode(GPIOB, LL_GPIO_PIN_12, LL_GPIO_MODE_ALTERNATE);
        /* USART2 TX */
        LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_12, LL_GPIO_MODE_ALTERNATE);

        Exit_Stop_Standby_Mode();
    }

    /* USER CODE BEGIN PWR_ExitStop2Mode_2 */

    /* USER CODE END PWR_ExitStop2Mode_2 */

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STOP2_MODE_EXIT);
}
#endif /* (CFG_LPM_STOP2_SUPPORTED == 1) */

#if (CFG_LPM_STOP1_SUPPORTED == 1)
OPTIMIZED static void PWR_EnterStopMode(void)
{
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STOP_MODE_ENTER);

    /* USER CODE BEGIN PWR_EnterStopMode_1 */

    /* USER CODE END PWR_EnterStopMode_1 */

    /* Notify the Link Layer platform layer the system will enter in WFI
     * and AHB5 clock may be turned of regarding the 2.4Ghz radio state
     */
    LINKLAYER_PLAT_NotifyWFIEnter();

    Enter_Stop_Standby_Mode();

    LL_PWR_SetPowerMode(LL_PWR_MODE_STOP1);

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STOP_MODE_ENTER);
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STOP_MODE_ACTIVE);

    __WFI();

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STOP_MODE_ACTIVE);

#if defined(STM32WBAXX_SI_CUT1_0)
    SYS_WAITING_CYCLES_25();
#endif /* STM32WBAXX_SI_CUT1_0 */
       /* USER CODE BEGIN PWR_EnterStopMode_2 */

