project-chip/connectedhomeip/examples/platform/stm32/STM32WBA65I-DK1/Common/WPAN/stm32_lpm_if.c
    /* USER CODE END PWR_EnterStopMode_2 */
}
#endif /* (CFG_LPM_STOP1_SUPPORTED == 1) */

#if (CFG_LPM_STOP1_SUPPORTED == 1)
OPTIMIZED static void PWR_ExitStopMode(void)
{
    SYSTEM_DEBUG_SIGNAL_SET(LOW_POWER_STOP_MODE_EXIT);

    /* USER CODE BEGIN PWR_ExitStopMode_1 */

    /* USER CODE END PWR_ExitStopMode_1 */

    /* Notify the Link Layer platform layer the system exited WFI
     * and AHB5 clock may be resynchronized as is may have been
     * turned of during low power mode entry.
     */
    LINKLAYER_PLAT_NotifyWFIExit();

    Exit_Stop_Standby_Mode();

    /* USER CODE BEGIN PWR_ExitStopMode_2 */

    /* USER CODE END PWR_ExitStopMode_2 */

    SYSTEM_DEBUG_SIGNAL_RESET(LOW_POWER_STOP_MODE_EXIT);
}
#endif /* (CFG_LPM_STOP1_SUPPORTED == 1) */

OPTIMIZED static void PWR_EnterSleepMode(void)
{
    /* USER CODE BEGIN PWR_EnterSleepMode_1 */

    /* USER CODE END PWR_EnterSleepMode_1 */

    /* Notify the Link Layer platform layer the system will enter in WFI
     * and AHB5 clock may be turned of regarding the 2.4Ghz radio state
     */
    LINKLAYER_PLAT_NotifyWFIEnter();

    LL_LPM_EnableSleep();
    __WFI();

    /* USER CODE BEGIN PWR_EnterSleepMode_2 */

    /* USER CODE END PWR_EnterSleepMode_2 */
}

OPTIMIZED static void PWR_ExitSleepMode(void)
{
    /* USER CODE BEGIN PWR_ExitSleepMode */

    /* USER CODE END PWR_ExitSleepMode */

    /* Notify the Link Layer platform layer the system exited WFI
     * and AHB5 clock may be resynchronized as is may have been
     * turned of during low power mode entry.
     */
    LINKLAYER_PLAT_NotifyWFIExit();
}

uint32_t is_boot_from_standby(void)
{
#if (CFG_DEBUGGER_LEVEL <= 1)
    LL_DBGMCU_DisableDBGStopMode();
    LL_DBGMCU_DisableDBGStandbyMode();
#endif /* CFG_DEBUGGER_LEVEL */

    __HAL_RCC_PWR_CLK_ENABLE();

    LL_PWR_EnableUltraLowPowerMode();
    __HAL_FLASH_SLEEP_POWERDOWN_ENABLE();

    /* Ensure this is a return from Standby, and not a reset */
    if ((LL_PWR_IsActiveFlag_SB() == 1UL) && (READ_REG(RCC->CSR) == 0U))
    {
        /* When exit from standby, disable IRQ so that restore and PWR_ExitOffMode are in critical section */
        __disable_irq();

        boot_after_standby = 1;
#if (CFG_LPM_WAKEUP_TIME_PROFILING == 1)
#if (CFG_LPM_STANDBY_SUPPORTED == 1)
        /* Perform standby wakeup time profiling if not already done */
        if (LPM_is_wakeup_time_profiling_done() == 0)
        {
            /* Set Systick clock source on LSE if LSE is ready, if not use LSI2 */
            CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_CLKSOURCE_Msk);
            if (LL_RCC_LSE_IsReady() == 1UL)
            {
                /* Configure sysTick clock source to LSE */
                LL_RCC_SetSystickClockSource(LL_RCC_SYSTICK_CLKSOURCE_LSE);
            }
            else
            {
#if defined(RCC_LSI2_SUPPORT)
                /* Enable LSI2 clock if not already done */
                if (LL_RCC_LSI2_IsReady() == 0UL)
                {
                    uint8_t pwrclkchanged = 0;
                    if (__HAL_RCC_PWR_IS_CLK_ENABLED() != 1U)
                    {
                        __HAL_RCC_PWR_CLK_ENABLE();
                        pwrclkchanged = 1;
                    }

                    /* Enable write access to Backup domain */
                    LL_PWR_EnableBkUpAccess();
                    while (LL_PWR_IsEnabledBkUpAccess() == 0UL)
                        ;

                    LL_RCC_LSI2_Enable();
                    while (LL_RCC_LSI2_IsReady() != 1UL)
                        ;

                    if (pwrclkchanged == 1)
                    {
                        __HAL_RCC_PWR_CLK_DISABLE();
                    }

                    /* Remember that LSI2 is used for wakeup time profiling */
                    lpm_profiling_started_lsi2 = 1;
                }

                /* Configure sysTick clock source to LSI2 */
                LL_RCC_SetSystickClockSource(LL_RCC_SYSTICK_CLKSOURCE_LSI);
#else
                Error_Handler();
#endif /* RCC_LSI2_SUPPORT */
            }

            /* Configure SysTick to full scale */
            WRITE_REG(SysTick->LOAD, 0x00FFFFFFUL);

            /* Enable SysTick Timer, starts to count */
            WRITE_REG(SysTick->VAL, 0UL);
            SET_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk);
        }
#endif /* CFG_LPM_STANDBY_SUPPORTED */
#endif /* CFG_LPM_WAKEUP_TIME_PROFILING */
    }
    else
    {
        boot_after_standby = 0;
    }

    return boot_after_standby;
}

#if (CFG_LPM_WAKEUP_TIME_PROFILING == 1)
#if (CFG_LPM_STANDBY_SUPPORTED == 1)
/* returns 0 if wakeup time profiling is not done */
uint32_t LPM_is_wakeup_time_profiling_done(void)
{
    return (lpm_wakeup_time_standby != 0);
}
#endif /* CFG_LPM_STANDBY_SUPPORTED */
#endif /* CFG_LPM_WAKEUP_TIME_PROFILING */

void LPM_IdleMode(uint32_t param)
{
    /* no low power action! */
    /* USER CODE BEGIN LPM_IdleMode */
    /* USER CODE END LPM_IdleMode */
}

void LPM_SleepMode(uint32_t param)
{
    PWR_EnterSleepMode();
    PWR_ExitSleepMode();
}

#if (CFG_LPM_STOP1_SUPPORTED == 1)
void LPM_Stop1Mode(uint32_t param)
{
    PWR_EnterStopMode();
    PWR_ExitStopMode();
}
#endif

#if (CFG_LPM_STOP2_SUPPORTED == 1)
void LPM_Stop2Mode(uint32_t param)
{
    PWR_EnterStop2Mode();
    PWR_ExitStop2Mode();
}
#endif

#if (CFG_LPM_STANDBY_SUPPORTED == 1)
void LPM_StandbyMode(uint32_t param)
{
    PWR_EnterOffMode();
    PWR_ExitOffMode();
}
#endif

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 1 */

/* USER CODE END 1 */
